Dear Participant,

We welcome you all to the case-based project of this course. This project has 2 case studies. The first case study (described below - 30 points) covers concepts taught in Part 1 (first 8 hours of Neural networks basics).

 ** Q.7 & 8 are "Optional".

1st case study - Project 1:

 

The case study is from an open source dataset from Kaggle. 

Link to the Kaggle project site:

In [0]:
import tensorflow as tf

In [0]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
bank_df = pd.read_csv('/content/drive/My Drive/AIML_Training/R6_Project 1/bank.csv')

In [6]:
bank_df.shape

(10000, 14)

1. Read the dataset

In [15]:
bank_df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

2. Drop the columns which are unique for all users like IDs (5 points)
3. Distinguish the feature and target set (5 points)

In [0]:
X = bank_df.iloc[:,3:13]  # Credit Score through Estimated Salary , removing unwanted columns (input features)
y = bank_df.iloc[:, 13]  # Exitednk -  Class (Target Set)

In [17]:
X.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female  ...          1               1        101348.88
1          608     Spain  Female  ...          0               1        112542.58
2          502    France  Female  ...          1               0        113931.57
3          699    France  Female  ...          0               0         93826.63
4          850     Spain  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [18]:
#Preprocess categorical data --> encode them

from sklearn.preprocessing import LabelEncoder
labelencoder_x = LabelEncoder()
X.iloc[:, 1] = labelencoder_x.fit_transform(X.iloc[:, 1]) #applying on Geography
X.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0  Female  ...          1               1        101348.88
1          608          2  Female  ...          0               1        112542.58
2          502          0  Female  ...          1               0        113931.57
3          699          0  Female  ...          0               0         93826.63
4          850          2  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [19]:
#apply encoder on Gender as well
labelencoder_x_2 = LabelEncoder()
X.iloc[:, 2] = labelencoder_x_2.fit_transform(X.iloc[:, 2]) #applying on Gender
X.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0       0  ...          1               1        101348.88
1          608          2       0  ...          0               1        112542.58
2          502          0       0  ...          1               0        113931.57
3          699          0       0  ...          0               0         93826.63
4          850          2       0  ...          1               1         79084.10

[5 rows x 10 columns]

In [21]:
#One hot encoding. 

from keras.utils import to_categorical
encoded = pd.DataFrame(to_categorical(X.iloc[:, 1]))

X = pd.concat([encoded, X], axis = 1)
X.head()

     0    1    2  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  1.0  0.0  0.0  ...          1               1        101348.88
1  0.0  0.0  1.0  ...          0               1        112542.58
2  1.0  0.0  0.0  ...          1               0        113931.57
3  1.0  0.0  0.0  ...          0               0         93826.63
4  0.0  0.0  1.0  ...          1               1         79084.10

[5 rows x 13 columns]

In [22]:
#Dropping the existing "geography" category, and one of the onehotcoded columns.

X = X.drop(['Geography', 0], axis = 1)
X.head()

     1    2  CreditScore  ...  HasCrCard  IsActiveMember  EstimatedSalary
0  0.0  0.0          619  ...          1               1        101348.88
1  0.0  1.0          608  ...          0               1        112542.58
2  0.0  0.0          502  ...          1               0        113931.57
3  0.0  0.0          699  ...          0               0         93826.63
4  0.0  1.0          850  ...          1               1         79084.10

[5 rows x 11 columns]

4. Divide the data set into Train and test sets
5. Normalize the train and test data (5 points)

In [0]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

# Feature Scaling
sc=StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

**6. Initialize & build the model (10 points)**

In [25]:
import keras
from keras.models import Sequential
from keras.layers import Dense #to add layers

Model = Sequential()
Model.add(Dense(output_dim = 6, init = 'uniform', activation = 'relu', input_dim = 11))

#init --> initialize weights according to uniform distribution
#input_dim is required for the first hidden layer, as it is the first starting point. --> number of nodes.
#output_dim --> number of nodes of the hidden layer

Model.add(Dense(output_dim = 6, init = 'uniform', activation = 'relu'))
#input_dim --> remove it as it already knows what to expect.

#the output layer
Model.add(Dense(output_dim = 1, init = 'uniform', activation = 'sigmoid'))
#output_dim should be 1, as output is binary outcome, and activation should be 'sigmoid'
#If dependent variables have more than two categories, use activation = 'softmax'

#compile the model --> backpropagation -> gradient descent
Model.compile(optimizer = 'adam', loss = "binary_crossentropy", metrics = ['accuracy'])

#optimizer = algorithm to find the optimal set of weights in ANN
#loss = functions that should be optimized. if more than two categories, use "categorical_crossentropy"
#metrics = criterion used to calculate the performance of the model.

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", input_dim=11, units=6, kernel_initializer="uniform")`

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:12: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", units=6, kernel_initializer="uniform")`
  if sys.path[0] == '':
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:16: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="sigmoid", units=1, kernel_initializer="uniform")`
  app.launch_new_instance()
W0901 13:20:57.372896 139790412814208 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/optimizers.py:793: The name tf.train.Optimizer is deprecated. Please use tf.compat.v1.train.Optimizer instead.

W0901 13:20:57.394181 139790412814208 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:3657: The name tf.log is deprecated. Please use tf.math.log instead.

W0901 13:20:57.400310 139790412814208 deprecation.py:323] From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/nn_impl.py:180: add_dispatch_support.<locals>.wrapper (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where

7.Optimize the model (Optional)

In [26]:
Model.fit(X_train, y_train, batch_size = 10, nb_epoch = 20)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.
  """Entry point for launching an IPython kernel.
W0901 13:21:45.278419 139790412814208 deprecation_wrapper.py:119] From /usr/local/lib/python3.6/dist-packages/keras/backend/tensorflow_backend.py:1033: The name tf.assign_add is deprecated. Please use tf.compat.v1.assign_add instead.

Epoch 1/20
8000/8000 [==============================] - 2s 208us/step - loss: 0.4777 - acc: 0.7957
Epoch 2/20
8000/8000 [==============================] - 1s 114us/step - loss: 0.4110 - acc: 0.8221
Epoch 3/20
8000/8000 [==============================] - 1s 116us/step - loss: 0.3965 - acc: 0.8287
Epoch 4/20
8000/8000 [==============================] - 1s 111us/step - loss: 0.3874 - acc: 0.8292
Epoch 5/20
8000/8000 [==============================] - 1s 113us/step - loss: 0.3806 - acc: 0.8312
Epoch 6/20
8000/8000 [==============================] - 1s 114us/step - loss: 0.3763 - acc: 0.8367
Epoch 7/20
8000/8000 [==============================] - 1s 111us/step - loss: 0.3725 - acc: 0.8449
Epoch 8/20
8000/8000 [==============================] - 1s 111us/step - loss: 0.3691 - acc: 0.8472
Epoch 9/20
8000/8000 [==============================] - 1s 111us/step - loss: 0.3671 - acc: 0.8501
Epoch 10/20
8000/8000 [==============================] - 1s 112us/step - loss: 0.3647 - acc: 0.8531
Epoch 11/20
8000/8000 [==============================] - 1s 110us/step - loss: 0.3627 - acc: 0.8509
Epoch 12/20
8000/8000 [==============================] - 1s 114us/step - loss: 0.3616 - acc: 0.8537
Epoch 13/20
8000/8000 [==============================] - 1s 110us/step - loss: 0.3604 - acc: 0.8520
Epoch 14/20
8000/8000 [==============================] - 1s 112us/step - loss: 0.3590 - acc: 0.8536
Epoch 15/20
8000/8000 [==============================] - 1s 114us/step - loss: 0.3581 - acc: 0.8546
Epoch 16/20
8000/8000 [==============================] - 1s 113us/step - loss: 0.3574 - acc: 0.8541
Epoch 17/20
8000/8000 [==============================] - 1s 113us/step - loss: 0.3563 - acc: 0.8552
Epoch 18/20
8000/8000 [==============================] - 1s 117us/step - loss: 0.3554 - acc: 0.8536
Epoch 19/20
8000/8000 [==============================] - 1s 117us/step - loss: 0.3543 - acc: 0.8580
Epoch 20/20
8000/8000 [==============================] - 1s 111us/step - loss: 0.3538 - acc: 0.8559

8. Predict the results using 0.5 as a threshold (Optional)

In [0]:
#predicting the results

y_pred = Model.predict(X_test)
y_pred = (y_pred > 0.5) #to classify each probability into True or False

**9. Print the Accuracy score and confusion matrix (5 points)**

In [37]:

from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)
print (cm, '\n\n', y_pred[:5, :])

[[1525   70]
 [ 212  193]]

 [[False]
 [False]
 [False]
 [False]
 [False]]

In [32]:
from sklearn import metrics
cm=metrics.classification_report(y_test,y_pred)
print(cm)

              precision    recall  f1-score   support

           0       0.88      0.96      0.92      1595
           1       0.73      0.48      0.58       405

    accuracy                           0.86      2000
   macro avg       0.81      0.72      0.75      2000
weighted avg       0.85      0.86      0.85      2000

In [34]:
print('Accuracy: ' , metrics.accuracy_score(y_test,y_pred))

Accuracy:  0.859

In [38]:
print (((cm[0][0]+cm[1][1])*100)/(cm[0][0]+cm[1][1]+cm[0][1]+cm[1][0]), '% of testing data was classified correctly')

85.9 % of testing data was classified correctly